app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."state" = ?  [["state", "to_do"]]
---
  def index
    @to_do = Task.all.where(state: "to_do")

INSERT INTO "tasks" ("content", "created_at", "updated_at", "state") VALUES (?, ?, ?, ?)  [["content", "create task"], ["created_at", 2016-09-13 18:47:00 UTC], ["updated_at", 2016-09-13 18:47:00 UTC], ["state", "doing"]]
---
  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save

UPDATE "tasks" SET "state" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["state", "to_do"], ["updated_at", 2016-09-13 19:16:28 UTC], ["id", 2]]
---
  def change
    @task.update_attributes(state: params[:state])